{
	"feedgroup": [
		{
			"feedtitle": "Mavo test",
			"category": "Tools"
		}
	],
	"aboutcontent": "### Welcome to the Front End Feed!\n\nMy name is Brian Haferkamp. I'm a Front End Developer with Tyndale House Publishers, a book publisher near Chicago. Like most web developers, I find myself searching online a lot for how to make magical things happen with a website or for my team. I'm also trying to keep up with the huge number of new frameworks, libraries, tools, and ideas in the constantly changing web design and development landscape. In the past I've use my Twitter account ([@brianhaferkamp](https://twitter.com/BrianHaferkamp)) to curate those resources, but it's not the best tool for going back and finding the things I've posted. \n\nI wanted to create a space where I could collect some of the best articles, tools, and videos that I watch on design and front end web development, but I didn't want to spin up a full blog. I've tried that in the past and just haven't been very successful at keeping it up to date. I don't want to have to login and then post. Lazy, I know, but I have a life. That's when I came across a solution that has solved my blogging needs for now.\n\nThe code that changed my blogging woes is called, Mavo. [Mavo.io](https://mavo.io) is a front end web library developed by MIT (lead by [Lea Verou](http://lea.verou.me/)) as a way to appify an HTML website without the need for a traditional back end setup. All of the data is stored in a JSON file on Github and is fed into the shell every time you access the site. No servers to set up and no databases to maintain. Best of all, changes can be made entirely in the browser. In fact, I've written this entire page in the browser. Mavo content editing supports a rich text editor and markdown (I prefer markdown).  That's been the real key to me sticking with the site. I can login, add a new link, save it and then get on with life. Sometimes I get fancy and add some images for the tools or videos, but it's not a major barrier. I can make changes on my phone, tablet, or computer. It's suuuuper simple. \n\nAs far as content is concerned, I wish it were not quite so random. I post here when I find something that's worth sharing or I want to reference in the future. I try to make a post every day, but I'm not perfect. The best way to check out the feed is to add the link to your home screen (on mobile or desktop) and check back every few days. I don't currently have RSS set up. \n\nIf you have any questions about the site or Mavo, [send me a tweet or DM on Twitter](https://twitter.com/BrianHaferkamp)."
}